Table of Contents
 Class ModelBIM
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
[DataContract]
public class ModelBIM
Inheritance
object
ModelBIM
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Items
[DataMember]
public List<BIMItemId> Items { get; set; }
Property Value
List<BIMItemId>
 Messages
[DataMember]
public OpenMessages Messages { get; set; }
Property Value
OpenMessages
 Model
[DataMember]
public OpenModel Model { get; set; }
Property Value
OpenModel
 Project
[DataMember]
public string Project { get; set; }
Property Value
string
 RequestedItems
[DataMember]
public RequestedItemsType RequestedItems { get; set; }
Property Value
RequestedItemsType
 Results
[DataMember]
public OpenModelResult Results { get; set; }
Property Value
OpenModelResult
 Edit this page